[
  "\"",
  "%",
  "&",
  "'",
  "'s",
  "(",
  "(6,6)-phenyl-C",
  "(C)-d",
  ")",
  ")-C",
  ").",
  "*",
  "*E",
  "+",
  ",",
  ",1",
  ",3",
  ",6",
  ",7",
  "-",
  "-(E",
  "-0.48",
  "-1",
  "-1.27",
  "-15",
  "-2",
  "-3.23",
  "-3.44",
  "-3.50",
  "-3.60",
  "-3.63",
  "-3.66",
  "-4.80",
  "-4.9",
  "-4.99",
  "-5",
  "-5.04",
  "-5.05",
  "-5.09",
  "-5.1",
  "-5.14",
  "-5.15",
  "-5.16",
  "-5.18",
  "-5.19",
  "-5.2",
  "-5.20",
  "-5.21",
  "-5.26",
  "-5.26eV",
  "-5.29",
  "-5.3",
  "-5.32",
  "-5.33",
  "-5.34",
  "-5.35",
  "-5.38",
  "-5.39",
  "-5.40",
  "-5.41",
  "-5.42",
  "-5.44",
  "-5.55",
  "-78",
  "-C",
  "-E",
  "-Se-π-bridges",
  "-V",
  "-benzothiadiazole",
  "-butyric",
  "-di-2-thienyl-5",
  "-e(E",
  ".",
  "/",
  "0",
  "0-0",
  "0-1",
  "0.01",
  "0.02",
  "0.04",
  "0.05",
  "0.08",
  "0.09",
  "0.1",
  "0.10",
  "0.12",
  "0.14",
  "0.17",
  "0.2",
  "0.24",
  "0.25",
  "0.28",
  "0.3",
  "0.30",
  "0.33",
  "0.34",
  "0.35",
  "0.36",
  "0.38",
  "0.39",
  "0.4",
  "0.40",
  "0.41",
  "0.42",
  "0.44",
  "0.45",
  "0.46",
  "0.47",
  "0.48",
  "0.49",
  "0.5",
  "0.50",
  "0.51",
  "0.52",
  "0.53",
  "0.54",
  "0.55",
  "0.563",
  "0.57",
  "0.576",
  "0.58",
  "0.59",
  "0.598",
  "0.6",
  "0.60",
  "0.608",
  "0.61",
  "0.62",
  "0.63",
  "0.64",
  "0.65",
  "0.67",
  "0.68",
  "0.7",
  "0.70",
  "0.71",
  "0.72",
  "0.73",
  "0.74",
  "0.75",
  "0.76",
  "0.77",
  "0.78",
  "0.79",
  "0.8",
  "0.80",
  "0.81",
  "0.82",
  "0.83",
  "0.84",
  "0.85",
  "0.86",
  "0.88",
  "0.89",
  "0.891",
  "0.9",
  "0.90",
  "0.91",
  "0.92",
  "0.94",
  "0.96",
  "0.97",
  "0.98",
  "00",
  "010",
  "03",
  "09",
  "0^0",
  "1",
  "1,2",
  "1,2,4-trichlorobenzene",
  "1,2-DCB",
  "1,2-dichlorobenzene",
  "1,8-diiodooctane",
  "1-3",
  "1-4",
  "1-5",
  "1-CN",
  "1-P",
  "1-chloronaphthalene",
  "1.",
  "1.0",
  "1.02",
  "1.03",
  "1.04",
  "1.05",
  "1.09",
  "1.1",
  "1.15",
  "1.18",
  "1.2",
  "1.22",
  "1.24",
  "1.25",
  "1.27",
  "1.29",
  "1.3",
  "1.33",
  "1.36",
  "1.37",
  "1.38",
  "1.39",
  "1.4",
  "1.40",
  "1.41",
  "1.44",
  "1.45",
  "1.46",
  "1.5",
  "1.50",
  "1.51",
  "1.52",
  "1.53",
  "1.55",
  "1.56",
  "1.57",
  "1.58",
  "1.5G",
  "1.6",
  "1.60",
  "1.61",
  "1.63",
  "1.64",
  "1.65",
  "1.66",
  "1.67",
  "1.67eV",
  "1.68",
  "1.7",
  "1.70",
  "1.71",
  "1.73",
  "1.75",
  "1.78",
  "1.79",
  "1.8",
  "1.80",
  "1.81",
  "1.82",
  "1.83",
  "1.84",
  "1.85",
  "1.86",
  "1.88",
  "1.9",
  "1.90",
  "1.91",
  "1.94",
  "1.95",
  "1.96",
  "1.99",
  "10",
  "10-20",
  "10.0",
  "10.08",
  "10.3",
  "100",
  "1000",
  "10^-2",
  "10^-3",
  "10^-4",
  "10^-5",
  "10^-6",
  "10^-7",
  "10^3",
  "10^4",
  "10^5",
  "10a",
  "11",
  "11,12",
  "11.2",
  "110",
  "12",
  "12,13",
  "12.33",
  "120",
  "1240",
  "13",
  "13,14",
  "13.26",
  "13.4",
  "130",
  "14",
  "14,15",
  "14.0",
  "14.6",
  "140",
  "15",
  "15,16",
  "15-17",
  "15.1",
  "15.8",
  "150",
  "15a",
  "16",
  "16,17",
  "16a",
  "17",
  "17,18",
  "17.0",
  "17.3",
  "175",
  "18",
  "18,19",
  "18.4",
  "18.5",
  "180",
  "19",
  "19,20",
  "1H",
  "1a",
  "1b",
  "2",
  "2,3",
  "2,5-bis(trimethylstannyl)thiophene",
  "2,5-diarylsilole",
  "2,5-dithienylsilole",
  "2,7-carbazole",
  "2,7-linked",
  "2,8-bis(alkoxy)dibenzothiophene",
  "2-D",
  "2-ethylhexyl",
  "2.0",
  "2.00",
  "2.01",
  "2.03",
  "2.05",
  "2.1",
  "2.10",
  "2.2",
  "2.3",
  "2.4",
  "2.5",
  "2.53",
  "2.6",
  "2.60",
  "2.7",
  "2.78",
  "2.8",
  "2.80",
  "2.81",
  "2.9",
  "2.92",
  "20",
  "20,21",
  "200",
  "2012",
  "2013",
  "20xx",
  "21",
  "21,22",
  "22",
  "23",
  "24",
  "24,25",
  "25",
  "25,26",
  "26",
  "26,27",
  "27",
  "27,28",
  "28",
  "28,29",
  "280",
  "29",
  "29,30",
  "2D",
  "2D-GIXRD",
  "2^0",
  "2^3",
  "2a",
  "2b",
  "2c",
  "2d",
  "2θ",
  "3",
  "3,4",
  "3,4-",
  "3,4-bis(octyloxy)benzothiadiazole",
  "3,7-linked",
  "3.0",
  "3.03",
  "3.04",
  "3.05",
  "3.06",
  "3.1",
  "3.15",
  "3.18",
  "3.19",
  "3.2",
  "3.3",
  "3.30",
  "3.35",
  "3.4",
  "3.40",
  "3.5",
  "3.53",
  "3.57",
  "3.6",
  "3.61",
  "3.64",
  "3.72",
  "3.73",
  "3.8",
  "3.80",
  "3.9",
  "3.93",
  "30",
  "30,31",
  "300",
  "300-400",
  "300-500",
  "300-650",
  "31",
  "32",
  "320",
  "33",
  "330",
  "34",
  "34-36",
  "35",
  "35,36",
  "350",
  "36",
  "37",
  "37,38",
  "38",
  "380",
  "381",
  "388",
  "39",
  "39,40",
  "392",
  "393",
  "3a",
  "3b",
  "3v",
  "4",
  "4,5",
  "4,9-positions",
  "4-5",
  "4-alkyl-3,5-difluorophenyl",
  "4-nitrophenyls",
  "4.0",
  "4.06",
  "4.1",
  "4.19",
  "4.2",
  "4.3",
  "4.33",
  "4.36",
  "4.4",
  "4.45",
  "4.48",
  "4.5",
  "4.57",
  "4.7",
  "4.71",
  "4.8",
  "4.86",
  "4.9",
  "4.93",
  "4.99",
  "40",
  "400",
  "400-550",
  "400-600",
  "400-700",
  "41",
  "410",
  "42",
  "420",
  "43",
  "430",
  "431",
  "432",
  "435",
  "437",
  "44",
  "444",
  "446",
  "45",
  "450",
  "46",
  "47",
  "47,48",
  "48",
  "480",
  "49",
  "49,50",
  "4a",
  "4b",
  "5",
  "5,6",
  "5-10",
  "5.0",
  "5.02",
  "5.1",
  "5.14",
  "5.18",
  "5.2",
  "5.21",
  "5.33",
  "5.35",
  "5.38",
  "5.4",
  "5.5",
  "5.50",
  "5.53",
  "5.55",
  "5.6",
  "5.62",
  "5.90",
  "50",
  "500",
  "51",
  "51,52",
  "510",
  "52",
  "53",
  "53.7",
  "535",
  "54",
  "55",
  "550",
  "555",
  "56",
  "56.1",
  "563",
  "57",
  "58",
  "590",
  "5a",
  "5b",
  "5c",
  "6",
  "6,7",
  "6-311G",
  "6-31G",
  "6-31G*",
  "6.0",
  "6.1",
  "6.2",
  "6.3",
  "6.41",
  "6.45",
  "6.5",
  "6.52",
  "6.54",
  "6.60",
  "6.7",
  "6.79",
  "6.83",
  "6.86",
  "6.9",
  "6.96",
  "60",
  "600",
  "600-900",
  "61",
  "61.8",
  "615",
  "618",
  "62",
  "620",
  "628",
  "63",
  "630",
  "631",
  "64",
  "65",
  "65.0",
  "650",
  "66",
  "670",
  "68",
  "680",
  "688",
  "69",
  "696",
  "6a",
  "6b",
  "7",
  "7-8",
  "7.02",
  "7.10",
  "7.13",
  "7.14",
  "7.2",
  "7.3",
  "7.32",
  "7.33",
  "7.34",
  "7.4",
  "7.41",
  "7.47",
  "7.49",
  "7.61",
  "7.66",
  "7.8",
  "7.81",
  "7.92",
  "70",
  "700",
  "71",
  "720",
  "722",
  "730",
  "742",
  "75",
  "750",
  "78",
  "7a",
  "8",
  "8,9",
  "8-10",
  "8.0",
  "8.00",
  "8.25",
  "8.31",
  "8.32",
  "8.5",
  "8.51",
  "8.55",
  "8.8",
  "8.81",
  "8.83",
  "8.85",
  "8.9",
  "80",
  "800",
  "808",
  "81",
  "85",
  "850",
  "8a",
  "9",
  "9,9-dialkyl-substituted",
  "9-12",
  "9-alkylidene-9H-fluorene",
  "9.2",
  "9.41",
  "9.50",
  "9.6",
  "9.89",
  "9.9",
  "9.92",
  "90",
  "900",
  "97",
  "9^8",
  "9a",
  "9b",
  ":",
  ";",
  "<",
  "=",
  ">",
  "@",
  "A",
  "ADA",
  "AFM",
  "AM",
  "AM1.5",
  "AM1.5G",
  "APFO",
  "ARTICLE",
  "ASSOCIATED",
  "Absorption",
  "AcOH",
  "Accepted",
  "According",
  "Accordingly",
  "Actually",
  "Additionally",
  "After",
  "Ag",
  "AgCl",
  "Al",
  "Al.",
  "All",
  "Along",
  "Also",
  "Alternatively",
  "Although",
  "Among",
  "An",
  "Analysis",
  "And",
  "Another",
  "Apparently",
  "Article",
  "As",
  "At",
  "Atomic",
  "Au",
  "Author",
  "B3LYP",
  "BA",
  "BBG",
  "BBPD",
  "BDD",
  "BDP",
  "BDT",
  "BDT-T",
  "BDTC",
  "BDTO",
  "BDTT",
  "BFR1",
  "BHJ",
  "BM",
  "BSe",
  "BT",
  "BTA",
  "BTz",
  "Based",
  "Because",
  "Besides",
  "Bipy",
  "Both",
  "Br",
  "Br-P3HT",
  "Bragg",
  "Bromination",
  "Bu",
  "Bulk",
  "But",
  "By",
  "C",
  "C-H",
  "C.",
  "C12",
  "C60",
  "CB",
  "CDT",
  "CF",
  "CH",
  "CHCl",
  "CIL",
  "CILs",
  "CN",
  "CONTENT",
  "CP",
  "CPDT",
  "CPDT-BT",
  "CPE",
  "CPE-S",
  "CSC",
  "CT",
  "CV",
  "CVs",
  "Ca",
  "Calculations",
  "CbpNSO",
  "Cell",
  "Characteristics",
  "Characterization",
  "Charge",
  "Chart",
  "Chemical",
  "Chemistry",
  "Chen",
  "Chinese",
  "Cl",
  "Clearly",
  "Combining",
  "Compared",
  "Comparing",
  "Comparison",
  "Compound",
  "Conditions",
  "Conjugated",
  "Consequently",
  "Considering",
  "Copolymer",
  "Corresponding",
  "Currently",
  "Cyclic",
  "D",
  "D-",
  "D-A",
  "D-π-A",
  "D1",
  "D1-A-D2-A",
  "DA",
  "DAD",
  "DCB",
  "DFBT",
  "DFT",
  "DHAP",
  "DHFBTA",
  "DIO",
  "DITT",
  "DMAc",
  "DMF",
  "DMSO",
  "DOT",
  "DPA",
  "DPAV",
  "DPAV-PT",
  "DPP",
  "DS",
  "DSC",
  "DTBSe",
  "DTBT",
  "DTBTA",
  "DTFBTA",
  "DTG",
  "DTGbased",
  "DTS",
  "DTT",
  "DTf",
  "DTff",
  "Despite",
  "Detailed",
  "Devices",
  "Different",
  "Diffraction",
  "Donor",
  "Due",
  "E",
  "EA",
  "EC",
  "EDDMs",
  "EHBDT",
  "EQE",
  "EQEs",
  "ESI",
  "ETL",
  "ETLs",
  "Effect",
  "Electrochemical",
  "Electronic",
  "Energy",
  "Especially",
  "Ethical",
  "Even",
  "Experimental",
  "External",
  "F",
  "F1",
  "F3",
  "F4",
  "F5",
  "FBT",
  "FEO",
  "FEOand",
  "FET",
  "FETs",
  "FF",
  "FN",
  "FWHM",
  "Fc",
  "FeCp",
  "Field",
  "Fig.",
  "Figure",
  "Figures",
  "Film",
  "Finally",
  "First",
  "For",
  "From",
  "Further",
  "Furthermore",
  "G",
  "GI",
  "GISAXS",
  "GIWAXS",
  "GIXD",
  "GIXS",
  "GPC",
  "GS",
  "G^100",
  "Gaussian",
  "Gaussian09",
  "Generally",
  "Given",
  "Green15",
  "Gurney",
  "H",
  "H-aggregate",
  "H11",
  "H2",
  "H6",
  "H7",
  "H8",
  "H9",
  "HFAQx",
  "HFAQx-T",
  "HFAQx-T:PC71BM",
  "HMBC",
  "HO-Ph-P3HT",
  "HOMO",
  "HOMO-LUMO",
  "HOMOs",
  "Hence",
  "Here",
  "Herein",
  "Heterojunction",
  "High",
  "Higher",
  "Hole",
  "Hou",
  "However",
  "Hz",
  "I",
  "I-V",
  "IC",
  "ICBA",
  "ICT",
  "IDTT",
  "IDTTBT",
  "IDTTFBT",
  "IDTTTPD",
  "IID",
  "IIa",
  "IIb",
  "ILC",
  "INCI",
  "IP",
  "IPCE",
  "IQE",
  "IR",
  "ITIC",
  "ITO",
  "If",
  "In",
  "Incorporation",
  "Indeed",
  "Information",
  "Interestingly",
  "Internet",
  "It",
  "J",
  "J-",
  "J-V",
  "J-aggregate",
  "J71",
  "J75",
  "J76",
  "J77",
  "JSC",
  "Jo",
  "Journal",
  "Jsc",
  "K",
  "L",
  "LBPP-3",
  "LBPP-4",
  "LC",
  "LUMO",
  "LUMOs",
  "Levels",
  "Li",
  "LiF",
  "Looking",
  "M",
  "M06",
  "M1",
  "M1-M6",
  "M2",
  "M3",
  "M4",
  "MHz",
  "MS",
  "Main",
  "Manuscript",
  "MeOH",
  "Meanwhile",
  "Mn",
  "MoO",
  "Mobility",
  "Molecular",
  "More",
  "Moreover",
  "Morphology",
  "Most",
  "Mott",
  "Mw",
  "N",
  "NBS",
  "NDF",
  "NIR",
  "NMR",
  "NOESY",
  "NPF",
  "NTDO",
  "Na",
  "NaOH",
  "Name",
  "Nevertheless",
  "New",
  "No",
  "Notably",
  "Note",
  "Nyquist",
  "O",
  "OC",
  "OCH",
  "ODCB",
  "ODTS",
  "OEG",
  "OFET",
  "OFETs",
  "OLEDs",
  "OOP",
  "OPV",
  "OPVs",
  "OSC",
  "OSCs",
  "OTFT",
  "OTPAV-PT",
  "OTS",
  "OXD",
  "Obviously",
  "Of",
  "On",
  "One",
  "Only",
  "Optical",
  "Optimized",
  "Organic",
  "Other",
  "Our",
  "Over",
  "Owing",
  "P",
  "P(BDT-F-BT)",
  "P(BDT-T-BT",
  "P(BDT-T-BT)",
  "P(BDT-TT-BT",
  "P(BDT-TT-BT)",
  "P(BDT-TT-BT)-EH",
  "P(BT-DPP)",
  "P(BT-DPP)-QP",
  "P(BT-DPP)-QP:PC71BM",
  "P(BT-DPP)-QPZn",
  "P(BT-DPP)-QPZn:PC71BM",
  "P(BT-DPP)-T",
  "P(C-BT-QP)",
  "P(C-T-QP)",
  "P(C-TT-QP",
  "P(C-TT-QP)",
  "P(C-TT-QP-Zn",
  "P(C-TT-QP-Zn)",
  "P(FBT-alt-CP",
  "P(FBT-alt-Se",
  "P(FBT-alt-Th",
  "P-1a",
  "P-1b",
  "P-1c",
  "P-Alkyl",
  "P-Alkyl:PC71BM",
  "P-OEG",
  "P-OEG:PC71BM",
  "P1",
  "P1-P3",
  "P1-P4",
  "P1-P6",
  "P1-c",
  "P2",
  "P3",
  "P3-P6",
  "P3HS",
  "P3HT",
  "P3HT-C",
  "P3HT-b-P(S",
  "P3S",
  "P3SDTDPP",
  "P3SDTDPP:PC71BM",
  "P3SDTQ",
  "P3T",
  "P3T-and",
  "P3TBDTDTBT",
  "P3TDTDPP",
  "P3TDTDPP:PC71BM",
  "P3TDTQ",
  "P4",
  "P4-P6",
  "P5",
  "P5-P6",
  "P6",
  "PAE",
  "PAFDTBT",
  "PBDT",
  "PBDT-",
  "PBDT-DFQX-TT",
  "PBDT-DFQX-TTSC8",
  "PBDT-DFQX-TTSEH",
  "PBDT-O-ADA",
  "PBDT-T-ADA",
  "PBDTC",
  "PBDTC-TT",
  "PBDTNTDO",
  "PBDTNTDO-1",
  "PBDTNTDO-2",
  "PBDTQS",
  "PBDTQTS",
  "PBDTSe-TT",
  "PBDTT",
  "PBDTT-TT",
  "PBDTT-TT-TEO",
  "PBDTT-TT-TEO:PCBM:PCB-TEO",
  "PBDTT-TTFQ:PC71BM",
  "PBDTTPTI",
  "PBDTTT",
  "PBDTTT-C-T",
  "PBDTTT-C12:PC71BM",
  "PBDTTT-TIPS:PC71BM",
  "PBDTTTP",
  "PBPD1",
  "PBPD2",
  "PBPD3",
  "PBT",
  "PBT-T12TT",
  "PBTCl",
  "PBTCl25",
  "PBTCl75",
  "PBTClx",
  "PBTTDPP-2FBT",
  "PBTTDPP-BT",
  "PBTTDPP-TT",
  "PC",
  "PC60BM",
  "PC61BM",
  "PC70BM",
  "PC71BM",
  "PCB",
  "PCBA",
  "PCBM",
  "PCBM)1",
  "PCBM-P3HT",
  "PCBM-Ph-P3HT",
  "PCBM-Ph-P3HT:P3HT",
  "PCDT",
  "PCDTBT",
  "PCE",
  "PCEs",
  "PCPDTBT",
  "PDBS",
  "PDBS-TQx:PC71BM",
  "PDBS-TQxF:PC71BM",
  "PDHBT",
  "PDI",
  "PDINO",
  "PDITTBT",
  "PDIs",
  "PDPBT",
  "PDPP",
  "PDPP-F",
  "PDPP3T",
  "PDPP3T:PC71BM",
  "PDPTT",
  "PDPTTOx",
  "PDTG",
  "PDTG-BT",
  "PDTS",
  "PDTS-BT",
  "PE",
  "PEDOT",
  "PF",
  "PFBDT",
  "PFBDT-",
  "PFBT-T12TT",
  "PFBT-T20TT",
  "PFDTBT",
  "PFN",
  "PFPy",
  "PFPy-",
  "PFPy-FO",
  "PFPy-FO-",
  "PFPy-P",
  "PIDTT",
  "PIDTT-TzTz-TT",
  "PIDTTBT",
  "PIDTTFBT",
  "PIDTTTPD",
  "PL",
  "PLEDs",
  "PNDFT",
  "POTBTV",
  "PPh",
  "PQ2T",
  "PQT",
  "PQTE",
  "PQTF",
  "PQTTST",
  "PSC",
  "PSCs",
  "PSS",
  "PSSS",
  "PSiF",
  "PSiFDCTBT",
  "PSiFDCTDPP",
  "PSiFDCTPD",
  "PT",
  "PT2TPA",
  "PT5TPA",
  "PTB",
  "PTB7",
  "PTB7-Th",
  "PTBTV",
  "PTEI",
  "PTEI-T",
  "PTNBr",
  "PTNBr-ZW",
  "PTPA",
  "PTPA-P3HT-PTPA",
  "PTQTS",
  "PTT",
  "PTTBTz",
  "PTV",
  "PTVs",
  "PTs",
  "PV",
  "PaNDTDPP",
  "PaNDTDTFBT",
  "Page",
  "Particularly",
  "Pd",
  "Pd(OAc)",
  "Pd(PPh",
  "PhBT12",
  "Photophysical",
  "Photovoltaic",
  "Please",
  "Pm",
  "Po",
  "Polymer",
  "Polymers",
  "Porphyrins",
  "Power",
  "Preliminary",
  "Properties",
  "Pt",
  "Q-band",
  "Q-bands",
  "QA",
  "QP",
  "QP-Zn",
  "QPZn",
  "QT",
  "QTS",
  "Qx",
  "R",
  "RMS",
  "RSoXs",
  "Random",
  "Recent",
  "Recently",
  "Replacing",
  "Rms",
  "Royal",
  "S",
  "S1",
  "S10",
  "S11",
  "S12",
  "S13",
  "S14",
  "S16",
  "S17",
  "S2",
  "S3",
  "S4",
  "S5",
  "S6",
  "S7",
  "S8",
  "S9",
  "SAM",
  "SC",
  "SCLC",
  "SDT",
  "SEC",
  "STILLE",
  "SWV",
  "Scheme",
  "Schemes",
  "Schlenk",
  "Schottky",
  "Se",
  "SeFBT",
  "Section",
  "See",
  "Several",
  "Si",
  "SiF",
  "SiFDCT",
  "SiFDCTBT",
  "SiFDCTDPP",
  "SiFDCTPD",
  "SiO",
  "Similar",
  "Similarly",
  "Since",
  "Single",
  "Sn",
  "Sn-IDTT",
  "So",
  "Society",
  "Solar",
  "Soluble",
  "Solution",
  "Some",
  "Sonogashira",
  "Soret",
  "Soxhlet",
  "Specifically",
  "Spectra",
  "Stability",
  "Steglich",
  "Stille",
  "Studies",
  "Study",
  "Such",
  "Supporting",
  "Surprisingly",
  "Suzuki",
  "Synthesis",
  "Synthetic",
  "T",
  "TBPD",
  "TBT",
  "TD",
  "TDPP",
  "TEI",
  "TEM",
  "TEO",
  "TFQ",
  "TGA",
  "THF",
  "TID",
  "TIPS",
  "TM",
  "TOF",
  "TPA",
  "TPD",
  "TPTI",
  "TPZ",
  "TQx",
  "TQxF",
  "TT",
  "TT-Cl",
  "TT-F",
  "TT1",
  "TT2",
  "TTBT",
  "TTF",
  "TTFQ",
  "TTP",
  "Table",
  "Tables",
  "Td",
  "Terms",
  "Th",
  "ThPt1",
  "ThPt1.5",
  "ThPt5",
  "ThPtx",
  "The",
  "Their",
  "Then",
  "Theoretical",
  "There",
  "Therefore",
  "Thermal",
  "Thermogravimetric",
  "These",
  "They",
  "Thin",
  "This",
  "Three",
  "Through",
  "Thus",
  "To",
  "Transistors",
  "Two",
  "TzQx",
  "TzTz",
  "U",
  "UV",
  "Under",
  "Unexpectedly",
  "Unfortunately",
  "Unlike",
  "Until",
  "Up",
  "Upon",
  "Using",
  "V",
  "VOC",
  "Various",
  "Very",
  "Vis",
  "W",
  "WB97XD",
  "WBG",
  "WF",
  "WFs",
  "WSCPs",
  "Waals",
  "Wang",
  "We",
  "When",
  "While",
  "With",
  "Without",
  "Wudl",
  "X-ray",
  "XRD",
  "XXX",
  "Xray",
  "Yang",
  "Zn",
  "ZnO",
  "ZrAcac",
  "[",
  "[1,2,5]thiadiazole",
  "[1,2-b;3,4-b]dithiophene",
  "[10][11][12]",
  "[16]",
  "[1][2][3]",
  "[1][2][3][4]",
  "[1][2][3][4][5]",
  "[3,2-b]thiophene",
  "[3,2b]thiophene",
  "[3,4-b]thiophene",
  "[3,4-c]pyrrole-4,6-dione",
  "[3][4][5][6]",
  "[6,6]-phenyl",
  "[6,6]-phenyl-C",
  "[60]PCBM",
  "[70]PCBM",
  "[7][8][9]",
  "[8][9][10][11]",
  "[eV]",
  "]",
  "]dithiophene",
  "a",
  "aNDT",
  "abilities",
  "ability",
  "about",
  "above",
  "abs",
  "absolute",
  "absorb",
  "absorbance",
  "absorbed",
  "absorbing",
  "absorbs",
  "absorption",
  "absorptions",
  "absorptivity",
  "accepted",
  "accepting",
  "acceptor",
  "acceptors",
  "accepts",
  "accord",
  "accordance",
  "according",
  "accordingly",
  "account",
  "accounted",
  "accounting",
  "accuracy",
  "acetate",
  "acetic",
  "acetone",
  "acetonitrile",
  "achieve",
  "achieved",
  "achievement",
  "achieves",
  "achieving",
  "acid",
  "acquired",
  "across",
  "act",
  "activated",
  "activation",
  "active",
  "actually",
  "added",
  "adding",
  "addition",
  "additional",
  "additive",
  "additives",
  "address",
  "adequate",
  "adjacent",
  "adjust",
  "adjusted",
  "adjusting",
  "adopt",
  "adopted",
  "advantage",
  "advantageous",
  "advantages",
  "affect",
  "affected",
  "affecting",
  "affects",
  "affinity",
  "afford",
  "afforded",
  "affording",
  "affords",
  "aforementioned",
  "after",
  "again",
  "against",
  "aggregate",
  "aggregated",
  "aggregates",
  "aggregation",
  "aggregations",
  "aging",
  "agree",
  "agreement",
  "agrees",
  "aim",
  "air",
  "al.",
  "alcohol",
  "aligned",
  "alignment",
  "alignments",
  "aliphatic",
  "alkoxy",
  "alkyl",
  "alkylthienyl",
  "alkylthio",
  "all",
  "allow",
  "allowed",
  "allowing",
  "allows",
  "almost",
  "along",
  "already",
  "also",
  "alter",
  "altered",
  "alternating",
  "alternative",
  "alternatives",
  "although",
  "always",
  "ambient",
  "ambipolar",
  "amine",
  "amino",
  "among",
  "amorphous",
  "amount",
  "amounts",
  "an",
  "analogous",
  "analogue",
  "analogues",
  "analyses",
  "analysis",
  "analytical",
  "analyzed",
  "analyzer",
  "and",
  "angle",
  "angles",
  "angular",
  "anhydrous",
  "anionic",
  "annealed",
  "annealing",
  "anode",
  "anodic",
  "another",
  "anticipated",
  "any",
  "apart",
  "app",
  "apparent",
  "apparently",
  "appealing",
  "appear",
  "appeared",
  "appears",
  "appl",
  "application",
  "applications",
  "applied",
  "apply",
  "applying",
  "approach",
  "approaches",
  "approaching",
  "appropriate",
  "approximated",
  "approximately",
  "aqueous",
  "arc",
  "architecture",
  "architectures",
  "are",
  "area",
  "areas",
  "argon",
  "arise",
  "arises",
  "arising",
  "aromatic",
  "aromaticity",
  "around",
  "arrangement",
  "arylation",
  "as",
  "as-cast",
  "as-synthesized",
  "ascribed",
  "assembled",
  "assembly",
  "assigned",
  "assignment",
  "assist",
  "assistant",
  "assisted",
  "associated",
  "assumed",
  "asymmetric",
  "at",
  "atmosphere",
  "atom",
  "atomic",
  "atoms",
  "attached",
  "attain",
  "attained",
  "attention",
  "attentions",
  "attracted",
  "attraction",
  "attractive",
  "attributable",
  "attribute",
  "attributed",
  "availability",
  "available",
  "average",
  "avoid",
  "avoiding",
  "axis",
  "aer",
  "b",
  "back",
  "backbone",
  "backbones",
  "background",
  "balance",
  "balanced",
  "band",
  "bandgap",
  "bandgaps",
  "bands",
  "bare",
  "barrier",
  "base",
  "based",
  "basic",
  "basically",
  "basis",
  "bathochromic",
  "be",
  "bearing",
  "became",
  "because",
  "become",
  "becomes",
  "been",
  "before",
  "behave",
  "behavior",
  "behaviors",
  "being",
  "believe",
  "believed",
  "belong",
  "below",
  "beneficial",
  "benefit",
  "benefiting",
  "benefits",
  "benefitted",
  "benecial",
  "benzene",
  "benzo",
  "benzo[1,2-b:4,5-b′]dithiophene",
  "benzo[2,1-b:3,4-b",
  "benzo[c]",
  "benzo[c][1,2,5]thiadiazole",
  "benzobisthiazole",
  "benzodithiophene",
  "benzophenone",
  "benzothiadiazole",
  "benzotriazole",
  "besides",
  "best",
  "better",
  "between",
  "bi",
  "bias",
  "bicontinuous",
  "big",
  "bimolecular",
  "binary",
  "binding",
  "bisadduct",
  "bithiazole",
  "bithiophene",
  "black",
  "blank",
  "blend",
  "blended",
  "blending",
  "blends",
  "block",
  "blocks",
  "blue",
  "boiling",
  "bond",
  "bonds",
  "both",
  "bottom",
  "bottom-gate",
  "br",
  "branched",
  "branching",
  "bridge",
  "bridged",
  "bridges",
  "bridging",
  "bright",
  "broad",
  "broaden",
  "broadened",
  "broadening",
  "broader",
  "bromide",
  "bromine",
  "brought",
  "build",
  "building",
  "built",
  "built-in",
  "bulk",
  "bulkheterojunction",
  "bulky",
  "but",
  "butadiyne",
  "butyric",
  "by",
  "c",
  "ca.",
  "cable",
  "cal",
  "calc",
  "calculated",
  "calculation",
  "calculations",
  "calibrated",
  "calibration",
  "calorimetry",
  "can",
  "candidate",
  "candidates",
  "capability",
  "capable",
  "capacitance",
  "capped",
  "capping",
  "caps",
  "capture",
  "carbazole",
  "carbon",
  "carbons",
  "carbonyl",
  "carboxylate",
  "careful",
  "carefully",
  "carried",
  "carrier",
  "carriers",
  "carrying",
  "case",
  "cases",
  "cast",
  "casted",
  "casting",
  "catalyst",
  "catalyzed",
  "cathode",
  "cathodes",
  "cationic",
  "cause",
  "caused",
  "causes",
  "cell",
  "cells",
  "centered",
  "central",
  "certain",
  "chain",
  "chained",
  "chains",
  "chalcogen",
  "challenge",
  "challenging",
  "champion",
  "change",
  "changed",
  "changes",
  "changing",
  "channel",
  "character",
  "characteristic",
  "characteristics",
  "characterization",
  "characterized",
  "characterizing",
  "characters",
  "charge",
  "charges",
  "chemical",
  "chemically",
  "chemistry",
  "chloride",
  "chlorinated",
  "chlorination",
  "chlorine",
  "chlorobenzene",
  "chloroform",
  "choice",
  "chose",
  "chosen",
  "chromatography",
  "chromophore",
  "chromophores",
  "circa",
  "circuit",
  "class",
  "clean",
  "clear",
  "clearly",
  "close",
  "closely",
  "closer",
  "clusters",
  "cm^-1",
  "cm^-2",
  "cm^2",
  "co-workers",
  "coated",
  "coating",
  "coefficient",
  "coefficients",
  "coherence",
  "coil",
  "coincident",
  "coincides",
  "collected",
  "collecting",
  "collection",
  "column",
  "combination",
  "combine",
  "combined",
  "combining",
  "come",
  "comes",
  "commercial",
  "commercialization",
  "commercially",
  "common",
  "commonly",
  "comonomer",
  "comonomers",
  "compact",
  "comparable",
  "comparative",
  "compare",
  "compared",
  "comparing",
  "comparison",
  "comparisons",
  "compatibility",
  "compatibilizer",
  "compatibilizing",
  "compatible",
  "compiled",
  "complementary",
  "complete",
  "completely",
  "complex",
  "complexes",
  "complexing",
  "complexity",
  "complicated",
  "component",
  "components",
  "composed",
  "composite",
  "composition",
  "compositional",
  "compositions",
  "compound",
  "compounds",
  "comprehensive",
  "comprised",
  "comprising",
  "computation",
  "concentrated",
  "concentration",
  "concept",
  "conclude",
  "concluded",
  "conclusion",
  "condensation",
  "condition",
  "conditions",
  "conducted",
  "conducting",
  "configuration",
  "confirm",
  "confirmed",
  "confirming",
  "confirms",
  "conformation",
  "conformations",
  "conjugated",
  "conjugation",
  "connected",
  "connectivity",
  "consequences",
  "consequently",
  "consider",
  "considerable",
  "considerably",
  "considerations",
  "considered",
  "considering",
  "consisted",
  "consistent",
  "consisting",
  "consists",
  "constant",
  "constituted",
  "construct",
  "constructed",
  "constructing",
  "construction",
  "contact",
  "contacts",
  "contain",
  "contained",
  "containing",
  "contains",
  "content",
  "context",
  "continuous",
  "contrary",
  "contrast",
  "contribute",
  "contributed",
  "contribution",
  "contributions",
  "control",
  "controlled",
  "controlling",
  "convenience",
  "conventional",
  "conversion",
  "converted",
  "conguration",
  "conrmed",
  "cooled",
  "cooling",
  "cooperative",
  "coordination",
  "coplanar",
  "coplanarity",
  "copolymer",
  "copolymerization",
  "copolymerized",
  "copolymerizing",
  "copolymers",
  "core",
  "cores",
  "correlated",
  "correlation",
  "correspond",
  "corresponded",
  "corresponding",
  "corresponds",
  "cost",
  "costs",
  "could",
  "counterpart",
  "counterparts",
  "couple",
  "coupling",
  "course",
  "covalently",
  "coverage",
  "covered",
  "covering",
  "covers",
  "coworkers",
  "create",
  "created",
  "critical",
  "cross",
  "cross-coupling",
  "cross-linking",
  "crosslinkable",
  "crucial",
  "crude",
  "crystal",
  "crystalline",
  "crystallinity",
  "crystallization",
  "crystals",
  "current",
  "currently",
  "currents",
  "curve",
  "curves",
  "cyano",
  "cyanovinylene",
  "cyclic",
  "cyclometalated",
  "cyclopentadithiophene",
  "d",
  "d,p",
  "d-spacing",
  "dark",
  "data",
  "date",
  "days",
  "dba",
  "deal",
  "decade",
  "decades",
  "decay",
  "decent",
  "decomposition",
  "decrease",
  "decreased",
  "decreases",
  "decreasing",
  "dedoping",
  "deduced",
  "deep",
  "deeper",
  "defects",
  "deficient",
  "defined",
  "deflected",
  "degassed",
  "degradation",
  "degree",
  "degrees",
  "deliver",
  "delivered",
  "delivering",
  "delocalization",
  "delocalized",
  "demand",
  "demonstrate",
  "demonstrated",
  "demonstrates",
  "demonstrating",
  "denoted",
  "dense",
  "densely",
  "densities",
  "density",
  "dependence",
  "dependent",
  "depending",
  "depends",
  "depicted",
  "deposited",
  "deposition",
  "depressing",
  "der",
  "derivative",
  "derivatives",
  "derived",
  "described",
  "deshielded",
  "design",
  "designed",
  "designing",
  "desirable",
  "desired",
  "despite",
  "destructive",
  "detail",
  "detailed",
  "details",
  "detected",
  "determine",
  "determined",
  "determining",
  "detrimental",
  "develop",
  "developed",
  "developing",
  "development",
  "deviation",
  "device",
  "devices",
  "devoted",
  "decient",
  "diagrams",
  "dialkoxybithiophene",
  "diameters",
  "dibenzosilole",
  "dibenzothiophene",
  "diblock",
  "dibromoporphyrin",
  "dichlorobenzene",
  "dichloromethane",
  "did",
  "dielectric",
  "diethyl",
  "diethynyldithienothiophene",
  "difference",
  "differences",
  "different",
  "differential",
  "difficult",
  "diffraction",
  "diffractions",
  "diffusion",
  "difluorinated",
  "dihedral",
  "diimide",
  "diketopyrrolopyrrole",
  "dilute",
  "dimension",
  "dimensional",
  "diminishment",
  "diode",
  "diodes",
  "dipole",
  "dipoles",
  "direct",
  "direction",
  "directions",
  "directly",
  "disadvantages",
  "discontinuous",
  "discrepancies",
  "discrepancy",
  "discussed",
  "disordered",
  "dispersed",
  "display",
  "displayed",
  "displays",
  "dissociated",
  "dissociation",
  "dissolution",
  "dissolved",
  "distance",
  "distances",
  "distannyl",
  "distilled",
  "distinct",
  "distinctly",
  "distinguished",
  "distributed",
  "distribution",
  "distributions",
  "dithienosilole",
  "dithiophene",
  "divalent",
  "do",
  "dodecyl",
  "does",
  "domain",
  "domains",
  "dominant",
  "dominated",
  "donating",
  "donor",
  "donor-",
  "donor-p-acceptor",
  "donoracceptor",
  "donors",
  "doped",
  "doping",
  "double",
  "doublets",
  "down",
  "downhill",
  "downward",
  "drain",
  "dramatic",
  "dramatically",
  "drastically",
  "drawbacks",
  "drawn",
  "dried",
  "driving",
  "drop",
  "dropped",
  "dropwise",
  "dry",
  "drying",
  "dual",
  "due",
  "during",
  "dye",
  "dynamics",
  "e",
  "e(E",
  "e.g.",
  "eV",
  "each",
  "earlier",
  "early",
  "ease",
  "easily",
  "easy",
  "ec",
  "edge",
  "edge-on",
  "edges",
  "editing",
  "eff",
  "effect",
  "effective",
  "effectively",
  "effectiveness",
  "effects",
  "efficiencies",
  "efficiency",
  "efficient",
  "efficiently",
  "effort",
  "efforts",
  "either",
  "electric",
  "electrical",
  "electroactivity",
  "electrochemical",
  "electrochemically",
  "electrode",
  "electrodes",
  "electroluminescent",
  "electron",
  "electronaccepting",
  "electronacceptor",
  "electrondeficient",
  "electrondonating",
  "electronegativity",
  "electronic",
  "electronics",
  "electrons",
  "electronwithdrawing",
  "electrostatic",
  "elemental",
  "elementary",
  "elevated",
  "elevating",
  "eliminated",
  "elucidate",
  "eluent",
  "embedded",
  "emerged",
  "emission",
  "emitting",
  "employed",
  "employing",
  "empty",
  "enable",
  "enabled",
  "enables",
  "end",
  "endcapped",
  "endcaps",
  "endow",
  "energetically",
  "energies",
  "energy",
  "engineering",
  "enhance",
  "enhanced",
  "enhancement",
  "enhancements",
  "enhances",
  "enhancing",
  "enlarge",
  "enlarged",
  "enough",
  "ensure",
  "ensures",
  "ensuring",
  "entangled",
  "enthalpic",
  "entire",
  "entries",
  "entry",
  "environmental",
  "eq",
  "equal",
  "equation",
  "equations",
  "equivalent",
  "error",
  "errors",
  "especially",
  "essential",
  "essentially",
  "established",
  "ester",
  "esterication",
  "estimate",
  "estimated",
  "estimation",
  "et",
  "etc",
  "etc.",
  "ethanol",
  "ether",
  "ethyl",
  "ethynyl",
  "evaluate",
  "evaluated",
  "evaporated",
  "evaporation",
  "even",
  "evenly",
  "event",
  "evidence",
  "evidenced",
  "evident",
  "evidently",
  "exact",
  "examine",
  "examined",
  "example",
  "examples",
  "exceeded",
  "exceeding",
  "excellent",
  "except",
  "exceptional",
  "excess",
  "excessive",
  "excitation",
  "excited",
  "exciton",
  "excitons",
  "excluded",
  "exhibit",
  "exhibited",
  "exhibiting",
  "exhibits",
  "exist",
  "existed",
  "existence",
  "existing",
  "exists",
  "exothermic",
  "exp",
  "expected",
  "experiment",
  "experimental",
  "experimentally",
  "experiments",
  "explain",
  "explained",
  "exploited",
  "exploration",
  "explore",
  "explored",
  "exposure",
  "expressed",
  "extend",
  "extended",
  "extending",
  "extends",
  "extension",
  "extensive",
  "extensively",
  "extent",
  "external",
  "extinction",
  "extra",
  "extracted",
  "extraction",
  "extremely",
  "f",
  "fDPP",
  "fabricate",
  "fabricated",
  "fabricating",
  "fabrication",
  "face",
  "face-on",
  "facile",
  "facilitate",
  "facilitated",
  "facilitates",
  "facilitating",
  "fact",
  "factor",
  "factors",
  "family",
  "famous",
  "far",
  "favor",
  "favorable",
  "favors",
  "feasible",
  "feature",
  "featureless",
  "features",
  "ferrocene",
  "ferrocenium",
  "few",
  "ffDPP",
  "fiber",
  "fibril",
  "fibrous",
  "field",
  "fieldeffect",
  "fields",
  "fill",
  "film",
  "films",
  "filtered",
  "filtration",
  "final",
  "finally",
  "fine",
  "finely",
  "finer",
  "first",
  "fit",
  "fitting",
  "five",
  "flask",
  "flexibility",
  "flexible",
  "fluorene",
  "fluorescence",
  "fluorinated",
  "fluorination",
  "fluorine",
  "flux",
  "focus",
  "focused",
  "followed",
  "following",
  "follows",
  "for",
  "force",
  "forced",
  "form",
  "formation",
  "formed",
  "former",
  "forming",
  "forms",
  "forward",
  "found",
  "four",
  "fraction",
  "framework",
  "free",
  "frequently",
  "from",
  "front",
  "frontier",
  "full",
  "fullerene",
  "fullerenes",
  "fully",
  "function",
  "functional",
  "functionalities",
  "functionalized",
  "functionals",
  "functions",
  "fundamental",
  "fundamentals",
  "funnel",
  "furan",
  "further",
  "fused",
  "fusing",
  "future",
  "g",
  "g,opt",
  "gain",
  "gap",
  "gaps",
  "gate",
  "gave",
  "gel",
  "general",
  "generally",
  "generate",
  "generated",
  "generation",
  "geometries",
  "geometry",
  "get",
  "give",
  "given",
  "gives",
  "giving",
  "glass",
  "glovebox",
  "glycol",
  "goal",
  "goes",
  "going",
  "gold",
  "good",
  "got",
  "grade",
  "gradually",
  "graphics",
  "gravimetric",
  "grazing",
  "great",
  "greater",
  "greatest",
  "greatly",
  "green",
  "group",
  "groups",
  "growing",
  "growth",
  "gs",
  "guarantee",
  "guideline",
  "guidelines",
  "h",
  "h.",
  "had",
  "half",
  "hamper",
  "hand",
  "hard",
  "hardly",
  "harvest",
  "harvesting",
  "has",
  "have",
  "having",
  "heated",
  "heating",
  "heavy",
  "height",
  "held",
  "help",
  "helpful",
  "helps",
  "hence",
  "heptacyclic",
  "here",
  "herein",
  "hetero",
  "heteroaromatic",
  "heterocyclic",
  "heterojunction",
  "hexacyclic",
  "hexagonal",
  "hexane",
  "hexyl",
  "high",
  "higher",
  "highest",
  "highly",
  "highperformance",
  "hinder",
  "hindrance",
  "hole",
  "holes",
  "homocoupling",
  "homogeneous",
  "homogeneously",
  "homopolymer",
  "hopping",
  "hot",
  "how",
  "however",
  "http://pubs.acs.org.",
  "humidity",
  "hundred",
  "hybrid",
  "hybrids",
  "hydrogen",
  "hyperconjugated",
  "hypsochromic",
  "i",
  "i.e.",
  "iccas.ac.cn",
  "ideal",
  "identical",
  "if",
  "ii",
  "iii",
  "illumination",
  "illustrate",
  "illustrated",
  "image",
  "images",
  "imaging",
  "imide",
  "imine",
  "impact",
  "impedance",
  "implied",
  "implies",
  "implying",
  "importance",
  "important",
  "importantly",
  "impressive",
  "improve",
  "improved",
  "improvement",
  "improvements",
  "improves",
  "improving",
  "in",
  "in-plane",
  "incidence",
  "incident",
  "include",
  "included",
  "including",
  "inclusion",
  "incorporate",
  "incorporated",
  "incorporating",
  "incorporation",
  "increase",
  "increased",
  "increases",
  "increasing",
  "increasingly",
  "indeed",
  "indene-C",
  "independent",
  "index",
  "indexes",
  "indicate",
  "indicated",
  "indicates",
  "indicating",
  "indication",
  "indices",
  "indium",
  "induce",
  "induced",
  "induces",
  "inducing",
  "industrial",
  "industry",
  "inefficient",
  "inert",
  "inf",
  "inferior",
  "influence",
  "influenced",
  "influences",
  "information",
  "infra",
  "infrared",
  "inherent",
  "initial",
  "injection",
  "inner",
  "inorganic",
  "inserting",
  "insertion",
  "inset",
  "insight",
  "insoluble",
  "instance",
  "instead",
  "insufficient",
  "insulator",
  "integral",
  "integrate",
  "integrated",
  "integration",
  "intense",
  "intensities",
  "intensity",
  "intensive",
  "intensively",
  "inter-chain",
  "inter-molecular",
  "interaction",
  "interactions",
  "interannular",
  "intercalate",
  "intercalation",
  "interchain",
  "interconnected",
  "interdigitation",
  "interest",
  "interesting",
  "interestingly",
  "interests",
  "interface",
  "interfaces",
  "interfacial",
  "interfering",
  "interlayer",
  "intermediate",
  "intermediates",
  "intermixing",
  "intermolecular",
  "internal",
  "interpenetrated",
  "interpenetrating",
  "interpreted",
  "into",
  "intrachain",
  "intramolecular",
  "intrinsic",
  "introduce",
  "introduced",
  "introducing",
  "introduction",
  "inversely",
  "inverted",
  "investigate",
  "investigated",
  "investigating",
  "investigation",
  "investigations",
  "involved",
  "involves",
  "involving",
  "inuence",
  "ion",
  "ionic",
  "ionization",
  "ionized",
  "irradiation",
  "irreversible",
  "is",
  "isoindigo",
  "isolated",
  "isolation",
  "issue",
  "issues",
  "it",
  "its",
  "itself",
  "j",
  "journal",
  "junction",
  "just",
  "k",
  "kDa",
  "kT",
  "keep",
  "key",
  "kg",
  "kind",
  "kinds",
  "know",
  "knowledge",
  "known",
  "l",
  "laboratory",
  "lack",
  "lactam",
  "ladder",
  "lamellae",
  "lamellar",
  "laminar",
  "large",
  "largely",
  "larger",
  "largest",
  "last",
  "later",
  "lateral",
  "latter",
  "lattice",
  "law",
  "layer",
  "layers",
  "lead",
  "leading",
  "leads",
  "leakage",
  "least",
  "led",
  "length",
  "lengths",
  "less",
  "level",
  "levels",
  "lifetime",
  "ligand",
  "light",
  "lightweight",
  "like",
  "likely",
  "limit",
  "limited",
  "limiting",
  "limits",
  "line",
  "linear",
  "lines",
  "linkage",
  "linked",
  "liquid",
  "listed",
  "lists",
  "literature",
  "literatures",
  "little",
  "living",
  "ln",
  "ln(JL",
  "loading",
  "local",
  "localized",
  "located",
  "lone",
  "long",
  "longer",
  "loss",
  "lost",
  "lot",
  "low",
  "lowbandgap",
  "lower",
  "lowered",
  "lowering",
  "lowers",
  "lowest",
  "lowlying",
  "lying",
  "m",
  "m-ITIC",
  "m1",
  "mA",
  "mL",
  "mV",
  "mW",
  "macrophase",
  "made",
  "magnesium",
  "magnitude",
  "mail",
  "main",
  "mainly",
  "maintain",
  "maintained",
  "maintaining",
  "major",
  "majority",
  "make",
  "makes",
  "making",
  "manifested",
  "manipulate",
  "manipulated",
  "manufacturing",
  "many",
  "margins",
  "marked",
  "markedly",
  "mass",
  "match",
  "matched",
  "matching",
  "material",
  "materials",
  "matrix",
  "max",
  "max,exp",
  "maxima",
  "maximal",
  "maximize",
  "maximum",
  "may",
  "mean",
  "means",
  "measure",
  "measured",
  "measurement",
  "measurements",
  "measuring",
  "mechanical",
  "mechanism",
  "medium",
  "meet",
  "melting",
  "member",
  "membered",
  "mention",
  "mentioned",
  "merely",
  "merits",
  "meta-fluorinated",
  "metal",
  "methanol",
  "method",
  "methodology",
  "methods",
  "methyl",
  "methylene",
  "mg",
  "microphase",
  "microscope",
  "microscopy",
  "microstructures",
  "microwave",
  "middle",
  "might",
  "migration",
  "min",
  "minimal",
  "minimize",
  "minimum",
  "minor",
  "miscibility",
  "mismatch",
  "mixed",
  "mixing",
  "mixture",
  "mixtures",
  "mm",
  "mmol",
  "mobilities",
  "mobility",
  "mode",
  "model",
  "modeling",
  "models",
  "moderate",
  "modification",
  "modifications",
  "modified",
  "modify",
  "modifying",
  "modulate",
  "modulation",
  "moieties",
  "moiety",
  "mol",
  "mol^-1",
  "molar",
  "molecular",
  "molecule",
  "molecules",
  "moment",
  "moments",
  "mono",
  "monochromatic",
  "monofluorinated",
  "monolayer",
  "monomer",
  "monomers",
  "monomolecular",
  "more",
  "morphological",
  "morphologies",
  "morphology",
  "most",
  "mostly",
  "motif",
  "much",
  "multifunctional",
  "multifused",
  "multiple",
  "must",
  "n",
  "n't",
  "n-OS",
  "n-butyllithium",
  "n-dope",
  "named",
  "namely",
  "nanofibrillar",
  "nanometers",
  "nanomorphology",
  "nanoscale",
  "nanoscaled",
  "nanostructure",
  "nanostructures",
  "nanobers",
  "naphthalene",
  "naphtho[2,3-c]thiophene-4,9-dione",
  "narrow",
  "narrower",
  "narrowing",
  "nature",
  "natures",
  "near",
  "near-IR",
  "nearly",
  "neat",
  "necessary",
  "need",
  "needed",
  "needle",
  "negative",
  "negligible",
  "neighboring",
  "network",
  "networks",
  "never",
  "nevertheless",
  "new",
  "newly",
  "next",
  "nitro",
  "nitrogen",
  "nkT",
  "nm",
  "no",
  "non-fluorinated",
  "non-fullerene",
  "non-linear",
  "noncovalent",
  "nonfluorinated",
  "nonfullerene",
  "normal",
  "normalized",
  "normally",
  "not",
  "note",
  "noted",
  "noteworthy",
  "notice",
  "noticed",
  "noting",
  "novel",
  "now",
  "nucleation",
  "number",
  "numberaverage",
  "numbers",
  "numerous",
  "o",
  "o-DCB",
  "o-dichlorobenzene",
  "o-tol",
  "observation",
  "observations",
  "observe",
  "observed",
  "obtain",
  "obtained",
  "obtaining",
  "obvious",
  "obviously",
  "oc",
  "occupied",
  "occur",
  "occurred",
  "occurs",
  "octadecyltrichlorosilane",
  "octyl",
  "octyloxy",
  "of",
  "off",
  "offer",
  "offers",
  "offset",
  "ofplane",
  "often",
  "ohmic",
  "oligomers",
  "oligothiophene",
  "omissions",
  "on",
  "one",
  "ones",
  "only",
  "onset",
  "onsets",
  "onto",
  "open",
  "opposite",
  "opt",
  "optical",
  "optimal",
  "optimization",
  "optimize",
  "optimized",
  "optimizing",
  "optimum",
  "optoelectronic",
  "or",
  "orbit",
  "orbital",
  "orbitals",
  "order",
  "ordered",
  "ordering",
  "orderly",
  "orders",
  "organic",
  "organization",
  "organized",
  "organometallic",
  "orientation",
  "orientations",
  "oriented",
  "origin",
  "originate",
  "originated",
  "originates",
  "originating",
  "ortho-fluorinated",
  "other",
  "our",
  "out",
  "outer",
  "outlined",
  "output",
  "over",
  "overall",
  "overcome",
  "overlap",
  "overnight",
  "owing",
  "ox",
  "oxidation",
  "oxidative",
  "oxide",
  "oxindole",
  "oxygen",
  "p",
  "p-channel",
  "p-p",
  "p-p*",
  "pack",
  "package",
  "packed",
  "packing",
  "pair",
  "palladium",
  "palladium(0)",
  "panchromatic",
  "paper",
  "para-phenylene",
  "parallel",
  "parameter",
  "parameters",
  "parent",
  "part",
  "partial",
  "partially",
  "particular",
  "particularly",
  "partly",
  "parts",
  "past",
  "pathway",
  "pathways",
  "pattern",
  "patterns",
  "peak",
  "peaked",
  "peaks",
  "pendant",
  "per",
  "percolated",
  "percolation",
  "perfect",
  "perform",
  "performance",
  "performances",
  "performed",
  "performing",
  "periodic",
  "permeation",
  "permittivity",
  "perspective",
  "perylene",
  "petroleum",
  "ph",
  "phase",
  "phases",
  "phenomena",
  "phenomenon",
  "phenyl",
  "phenylene",
  "phenylenevinylene",
  "phosphine",
  "photo",
  "photoactive",
  "photochemical",
  "photocurrent",
  "photocurrents",
  "photogenerated",
  "photogeneration",
  "photoinduced",
  "photoluminescence",
  "photon",
  "photons",
  "photophysical",
  "photoresponse",
  "photosensitive",
  "photovoltaic",
  "photovoltaics",
  "phthalimide",
  "physical",
  "physicochemical",
  "pico",
  "pinhole",
  "place",
  "planar",
  "planarity",
  "planarization",
  "plane",
  "plastic",
  "plate",
  "play",
  "played",
  "plays",
  "plot",
  "plots",
  "plotted",
  "point",
  "pointing",
  "points",
  "polar",
  "polarity",
  "polarizable",
  "poly",
  "poly(3-alkylthiophene)",
  "poly(3-hexylthiophene)",
  "poly(styrenesulfonate)",
  "polycondensation",
  "polydispersity",
  "polyelectrolyte",
  "polyfluorene",
  "polymer",
  "polymeric",
  "polymerization",
  "polymerizations",
  "polymerized",
  "polymers",
  "polystyrene",
  "polystyrenes",
  "polythiophene",
  "polythiophenes",
  "poor",
  "poorer",
  "poorest",
  "popular",
  "porphyrin",
  "porphyrin-dithienothiophene",
  "porphyrins",
  "portion",
  "position",
  "positions",
  "positive",
  "positively",
  "possess",
  "possessed",
  "possesses",
  "possessing",
  "possibility",
  "possible",
  "possibly",
  "post-treatment",
  "post-treatments",
  "postpolymerization",
  "posttreatment",
  "potassium",
  "potential",
  "potentially",
  "potentials",
  "poured",
  "powder",
  "power",
  "ppm",
  "practical",
  "precipitate",
  "precipitated",
  "precipitates",
  "precipitation",
  "precisely",
  "precursor",
  "predominantly",
  "preferable",
  "preferentially",
  "preferred",
  "preliminary",
  "preparation",
  "prepare",
  "prepared",
  "preparing",
  "prerequisites",
  "presence",
  "present",
  "presented",
  "presents",
  "pressure",
  "presumably",
  "prevent",
  "preventing",
  "prevents",
  "previous",
  "previously",
  "primarily",
  "primary",
  "principle",
  "printing",
  "prior",
  "pristine",
  "probability",
  "probable",
  "probably",
  "probe",
  "problem",
  "problems",
  "procedure",
  "procedures",
  "process",
  "processabilities",
  "processability",
  "processable",
  "processed",
  "processes",
  "processing",
  "produce",
  "produced",
  "producing",
  "product",
  "production",
  "products",
  "profile",
  "profiles",
  "program",
  "progress",
  "prolonged",
  "prominent",
  "promising",
  "promote",
  "promoted",
  "promotes",
  "pronounced",
  "proper",
  "properties",
  "property",
  "proportional",
  "propose",
  "proposed",
  "protection",
  "protocol",
  "proton",
  "protons",
  "proved",
  "proven",
  "provide",
  "provided",
  "provides",
  "providing",
  "prole",
  "pull",
  "pulse",
  "purchased",
  "pure",
  "purged",
  "purification",
  "purified",
  "purity",
  "purple",
  "push",
  "put",
  "pyridine",
  "q",
  "quality",
  "quantum",
  "quartz",
  "quasi-reversible",
  "quenched",
  "quenching",
  "quinacridone",
  "quinoid",
  "quinoidal",
  "quinoxaline",
  "quinoxalinoporphyrin",
  "quite",
  "r",
  "ra",
  "radiation",
  "radius",
  "raised",
  "raising",
  "random",
  "range",
  "ranges",
  "ranging",
  "rapid",
  "rate",
  "rather",
  "ratio",
  "rational",
  "ratios",
  "re",
  "reach",
  "reached",
  "reaches",
  "reacted",
  "reacting",
  "reaction",
  "reactions",
  "readily",
  "reagent",
  "reagents",
  "real",
  "realize",
  "realized",
  "realizing",
  "reason",
  "reasonable",
  "reasonably",
  "reasons",
  "received",
  "recent",
  "recently",
  "recognized",
  "recombination",
  "record",
  "recorded",
  "recovered",
  "recrystallization",
  "red",
  "redox",
  "redshifted",
  "reduce",
  "reduced",
  "reduces",
  "reducing",
  "reduction",
  "reductive",
  "reference",
  "referred",
  "reflected",
  "reflection",
  "reflections",
  "reflux",
  "refluxed",
  "regard",
  "regime",
  "regiochemical",
  "regiochemistry",
  "region",
  "regions",
  "regioregular",
  "regioregularity",
  "regular",
  "regularly",
  "related",
  "relation",
  "relationship",
  "relationships",
  "relative",
  "relatively",
  "relevant",
  "reliability",
  "remain",
  "remains",
  "remarkable",
  "remarkably",
  "remove",
  "removed",
  "renewable",
  "reorganization",
  "repeat",
  "repeating",
  "replace",
  "replaced",
  "replacement",
  "replacing",
  "report",
  "reported",
  "reports",
  "representative",
  "represents",
  "reproducibility",
  "repulsion",
  "require",
  "required",
  "requirement",
  "requirements",
  "requires",
  "research",
  "researches",
  "residual",
  "residue",
  "resistance",
  "resolution",
  "resolved",
  "resonance",
  "resonances",
  "respect",
  "respective",
  "respectively",
  "response",
  "responses",
  "responsible",
  "result",
  "resultant",
  "resulted",
  "resulting",
  "results",
  "retained",
  "reveal",
  "revealed",
  "reveals",
  "reverse",
  "reversed",
  "reversible",
  "reection",
  "rich",
  "rigid",
  "rigidity",
  "ring",
  "rings",
  "rise",
  "rms",
  "rod",
  "role",
  "roles",
  "roll",
  "room",
  "root",
  "root-mean-square",
  "rough",
  "rougher",
  "roughness",
  "roughnesses",
  "route",
  "routes",
  "rules",
  "s",
  "s^-1",
  "same",
  "sample",
  "samples",
  "sat",
  "satisfactorily",
  "saturated",
  "saturation",
  "sc",
  "scaffolds",
  "scalability",
  "scale",
  "scan",
  "scanning",
  "scans",
  "scattering",
  "scientific",
  "second",
  "secondary",
  "section",
  "see",
  "seems",
  "seen",
  "segment",
  "segments",
  "segregation",
  "selected",
  "selecting",
  "selection",
  "selective",
  "selenium",
  "selenophene",
  "selenophenes",
  "self",
  "selfaggregation",
  "semiconducting",
  "semiconductor",
  "semiconductors",
  "semicrystalline",
  "sensitive",
  "sensitivity",
  "sensors",
  "separated",
  "separation",
  "sequence",
  "series",
  "serious",
  "seriously",
  "serve",
  "set",
  "seven",
  "several",
  "severe",
  "sh",
  "shall",
  "shape",
  "shaped",
  "shapes",
  "sharp",
  "sharper",
  "shed",
  "shift",
  "shifted",
  "shifting",
  "shifts",
  "shi",
  "shied",
  "short",
  "shorter",
  "should",
  "shoulder",
  "shoulders",
  "show",
  "showed",
  "showing",
  "shown",
  "shows",
  "shunt",
  "side",
  "sides",
  "signal",
  "signals",
  "significant",
  "significantly",
  "signicant",
  "signicantly",
  "silafluorene",
  "silica",
  "silicon",
  "similar",
  "similarity",
  "simple",
  "simplicity",
  "simplified",
  "simplify",
  "simply",
  "simulated",
  "simulation",
  "simulator",
  "simultaneously",
  "since",
  "single",
  "singlet",
  "six",
  "size",
  "sizes",
  "slight",
  "slightly",
  "slope",
  "slow",
  "small",
  "smaller",
  "smallest",
  "smooth",
  "smoother",
  "so",
  "sodium",
  "solar",
  "solid",
  "solids",
  "solubilities",
  "solubility",
  "solubilizing",
  "soluble",
  "solution",
  "solutions",
  "solve",
  "solvent",
  "solvents",
  "some",
  "somewhat",
  "source",
  "sources",
  "sp",
  "space",
  "spacer",
  "spacers",
  "spacing",
  "spacings",
  "species",
  "specific",
  "spectra",
  "spectral",
  "spectrometer",
  "spectrometry",
  "spectroscopic",
  "spectroscopy",
  "spectrum",
  "speed",
  "speeds",
  "sphere",
  "spin",
  "spincoated",
  "spincoating",
  "spontaneous",
  "spots",
  "square",
  "stabilities",
  "stability",
  "stabilization",
  "stabilize",
  "stable",
  "stacked",
  "stacking",
  "stackings",
  "stage",
  "standard",
  "standards",
  "state",
  "states",
  "steep",
  "step",
  "steps",
  "steric",
  "still",
  "stirred",
  "straight",
  "straightforward",
  "strategies",
  "strategy",
  "stratragies",
  "strength",
  "strengthen",
  "strengths",
  "strong",
  "stronger",
  "strongest",
  "strongly",
  "structural",
  "structure",
  "structured",
  "structures",
  "studied",
  "studies",
  "study",
  "studying",
  "subjected",
  "subsequent",
  "subsequently",
  "substantial",
  "substantially",
  "substituent",
  "substituents",
  "substitute",
  "substituted",
  "substitution",
  "substitutions",
  "substrate",
  "substrates",
  "subtle",
  "successful",
  "successfully",
  "successively",
  "such",
  "suffer",
  "sufficient",
  "sufficiently",
  "suggest",
  "suggested",
  "suggesting",
  "suggests",
  "suitable",
  "suite",
  "sulfate",
  "sulfur",
  "summarized",
  "summarizes",
  "summary",
  "sun",
  "sunlight",
  "superior",
  "supported",
  "supporting",
  "supports",
  "suppress",
  "suppressed",
  "surface",
  "surfaces",
  "surfactant",
  "susceptible",
  "symmetric",
  "symmetry",
  "synthesis",
  "synthesize",
  "synthesized",
  "synthesizing",
  "synthetic",
  "system",
  "systematic",
  "systematically",
  "systems",
  "t",
  "tail",
  "tailor",
  "tailoring",
  "take",
  "taken",
  "takes",
  "tandem",
  "tapping",
  "target",
  "technical",
  "technique",
  "techniques",
  "technology",
  "temperature",
  "temperatures",
  "tend",
  "tendency",
  "term",
  "terminal",
  "terms",
  "ternary",
  "terpolymer",
  "terpolymers",
  "terthiophene",
  "tested",
  "tetrabutylammonium",
  "tetracyclic",
  "tetrafluoroborate",
  "tetrahydrofuran",
  "tetrathienyl",
  "text",
  "th",
  "than",
  "that",
  "the",
  "their",
  "them",
  "themselves",
  "then",
  "theoretical",
  "theory",
  "there",
  "thereby",
  "therefore",
  "thermal",
  "thermally",
  "thermogravimetric",
  "these",
  "they",
  "thiazole",
  "thiazole-",
  "thiazole-DPP",
  "thiazolothiazole",
  "thick",
  "thicker",
  "thickness",
  "thicknesses",
  "thieno",
  "thieno[3,2-b]thiophene",
  "thienothiophene",
  "thienyl",
  "thienyl-fluorene-thienyl",
  "thienyl-quinoxaline",
  "thin",
  "thiophene",
  "thiophenes",
  "third",
  "this",
  "those",
  "though",
  "thought",
  "three",
  "threshold",
  "through",
  "thus",
  "time",
  "times",
  "tin",
  "to",
